{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "import numpy as np\n",
    "from SPARQLWrapper import SPARQLWrapper, JSON\n",
    "import nltk, inflect, re, string, os"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 113,
   "metadata": {},
   "outputs": [],
   "source": [
    "# https://pypi.python.org/pypi/inflect\n",
    "p = inflect.engine()\n",
    "os.environ['EC2_URI'] = 'http://ec2-18-188-157-163.us-east-2.compute.amazonaws.com:3030/dbkwik/query'\n",
    "%run helpers.py"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 114,
   "metadata": {},
   "outputs": [],
   "source": [
    "# URI = 'http://dbkwik.webdatacommons.org/HarryPotter/resource/Harry_Potter'\n",
    "# URI = 'http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/resource/Daenerys_Targaryen'\n",
    "# URI = 'http://dbkwik.webdatacommons.org/GTA_Wik/resource/Russia'\n",
    "URI = 'http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/resource/Jon_Snow'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 115,
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "SELECT (group_concat(?type;separator='|') as ?types) ?name ?gender ?dbr WHERE {        \n",
      "        # Get Types of URI\n",
      "        <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/resource/Jon_Snow> rdf:type ?type .\n",
      "        FILTER(contains(str(?type), 'http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/ontology')) .\n",
      "        \n",
      "        # Get English label of URI\n",
      "        OPTIONAL { <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/resource/Jon_Snow> <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/property/name> ?name . FILTER(lang(?name)='en') . }\n",
      "        OPTIONAL { <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/resource/Jon_Snow> <http://www.w3.org/2004/02/skos/core#prefLabel> ?name . FILTER(lang(?name)='en') . }\n",
      "        OPTIONAL { <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/resource/Jon_Snow> <http://www.w3.org/2000/01/rdf-schema#label> ?name . FILTER(lang(?name)='en') . }        \n",
      "                \n",
      "        # Try to get gender\n",
      "        OPTIONAL { <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/resource/Jon_Snow> <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/property/gender> ?gender . }\n",
      "        \n",
      "        # Try to get corresponding DBpedia Resource\n",
      "        OPTIONAL { <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/resource/Jon_Snow> owl:sameAs ?dbr . }\n",
      "    }\n",
      "    \n",
      "\n",
      "    SELECT ?p ?p_label ?o ?prop_final_rank ?obj_rank ?rank ?reverse {\n",
      "        {\n",
      "            SELECT ?p ?p_label ?o ?obj_rank (max(?prop_rank) as ?prop_final_rank) ?reverse {\n",
      "                {<http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/resource/Jon_Snow> ?p ?o . BIND(false as ?reverse)} UNION {?o ?p <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/resource/Jon_Snow> . BIND(true as ?reverse)}\n",
      "\n",
      "                FILTER (?p NOT IN (\n",
      "                    <http://purl.org/dc/terms/subject>, \n",
      "                    <http://xmlns.com/foaf/0.1/depiction>, \n",
      "                    <http://www.w3.org/2002/07/owl#sameAs>, \n",
      "                    <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/ontology/thumbnail>, \n",
      "                    <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/property/predecessor>,\n",
      "                    <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/property/successor>, \n",
      "                    <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/property/name>, \n",
      "                    <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/property/gender>, \n",
      "                    <http://xmlns.com/foaf/0.1/isPrimaryTopicOf>, \n",
      "                    <http://xmlns.com/foaf/0.1/primaryTopic>                    \n",
      "                )) .\n",
      "\n",
      "                ?p <http://www.w3.org/2000/01/rdf-schema#label> ?p_label .\n",
      "                FILTER(lang(?p_label)='en') .\n",
      "\n",
      "                OPTIONAL { <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/resource/Jon_Snow> <http://www.w3.org/1999/02/22-rdf-syntax-ns#type> ?class . ?p ?class ?prop_rank }\n",
      "                OPTIONAL { ?p <http://purl.org/voc/vrank#proprank> ?prop_rank }\n",
      "                OPTIONAL { ?o <http://purl.org/voc/vrank#pagerank> ?obj_rank }\n",
      "                OPTIONAL { FILTER ISLITERAL(?o) . BIND(0.15 as ?obj_rank) }    \n",
      "            } GROUP BY ?o ?obj_rank ?p ?p_label ?reverse\n",
      "        }\n",
      "        #BIND(?obj_rank * ?prop_final_rank as ?rank) # PROD RANK\n",
      "        BIND(?obj_rank * ?prop_final_rank / (?obj_rank + ?prop_final_rank) as ?rank) # HARMONIC RANK\n",
      "    } ORDER BY DESC(?rank)    \n",
      "    \n"
     ]
    }
   ],
   "source": [
    "basic_info = get_basic_info(URI)\n",
    "top_triples = get_top_k_triples(URI, 10)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 120,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Agent\n",
      "FictionalCharacter\n",
      "SELECT ?label WHERE {        \n",
      "        <http://dbpedia.org/ontology/FictionalCharacter> rdfs:label ?label .\n",
      "        FILTER(lang(?label)='en')\n",
      "    }\n",
      "    \n",
      "Person\n",
      "SELECT ?label WHERE {        \n",
      "        <http://dbpedia.org/ontology/Person> rdfs:label ?label .\n",
      "        FILTER(lang(?label)='en')\n",
      "    }\n",
      "    \n"
     ]
    }
   ],
   "source": [
    "# Maybe handle plural for pronoun and possessive pronoun\n",
    "summary = ''\n",
    "pronoun = 'It'\n",
    "possessive_pronoun = 'Its'\n",
    "name = basic_info['name']\n",
    "\n",
    "if 'types' in basic_info:\n",
    "    types = basic_info['types'].split('|')\n",
    "    summary += name + ' is '\n",
    "    types_sents = []\n",
    "    for i in range(len(types)):\n",
    "        ontology_type = types[i].split('/')[-1]\n",
    "        print(ontology_type)\n",
    "        if ontology_type.lower() == 'agent': # Ignore Agent\n",
    "            continue\n",
    "        \n",
    "        types_sents.append(p.a(get_ontology_label(ontology_type)))\n",
    "    \n",
    "    summary += combine_conjunctive_sentences(types_sents) + '. '\n",
    "\n",
    "if 'gender' in basic_info:\n",
    "    if basic_info['gender'].lower() == 'male':\n",
    "        pronoun = 'He'\n",
    "        possessive_pronoun = 'His'\n",
    "        summary += 'His gender is male. '\n",
    "    elif basic_info['gender'].lower() == 'female':\n",
    "        pronoun = 'She'\n",
    "        possessive_pronoun = 'Her'\n",
    "        summary += 'Her gender is female. '"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 121,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "SELECT ?name ?dbr WHERE {        \n",
      "        # Get English label of URI\n",
      "        OPTIONAL { <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/resource/House_Stark> <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/property/name> ?name . FILTER(lang(?name)='en') . }\n",
      "        OPTIONAL { <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/resource/House_Stark> <http://www.w3.org/2004/02/skos/core#prefLabel> ?name . FILTER(lang(?name)='en') . }       \n",
      "        OPTIONAL { <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/resource/House_Stark> <http://www.w3.org/2000/01/rdf-schema#label> ?name . FILTER(lang(?name)='en') . }        \n",
      "        OPTIONAL { <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/resource/House_Stark> <http://www.w3.org/2002/07/owl#sameAs> ?dbr . }\n",
      "    }\n",
      "    \n",
      "SELECT ?name ?dbr WHERE {        \n",
      "        # Get English label of URI\n",
      "        OPTIONAL { <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/resource/Tormund> <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/property/name> ?name . FILTER(lang(?name)='en') . }\n",
      "        OPTIONAL { <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/resource/Tormund> <http://www.w3.org/2004/02/skos/core#prefLabel> ?name . FILTER(lang(?name)='en') . }       \n",
      "        OPTIONAL { <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/resource/Tormund> <http://www.w3.org/2000/01/rdf-schema#label> ?name . FILTER(lang(?name)='en') . }        \n",
      "        OPTIONAL { <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/resource/Tormund> <http://www.w3.org/2002/07/owl#sameAs> ?dbr . }\n",
      "    }\n",
      "    \n",
      "SELECT ?name ?dbr WHERE {        \n",
      "        # Get English label of URI\n",
      "        OPTIONAL { <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/resource/Dim_Dalba> <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/property/name> ?name . FILTER(lang(?name)='en') . }\n",
      "        OPTIONAL { <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/resource/Dim_Dalba> <http://www.w3.org/2004/02/skos/core#prefLabel> ?name . FILTER(lang(?name)='en') . }       \n",
      "        OPTIONAL { <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/resource/Dim_Dalba> <http://www.w3.org/2000/01/rdf-schema#label> ?name . FILTER(lang(?name)='en') . }        \n",
      "        OPTIONAL { <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/resource/Dim_Dalba> <http://www.w3.org/2002/07/owl#sameAs> ?dbr . }\n",
      "    }\n",
      "    \n",
      "SELECT ?name ?dbr WHERE {        \n",
      "        # Get English label of URI\n",
      "        OPTIONAL { <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/resource/Melisandre> <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/property/name> ?name . FILTER(lang(?name)='en') . }\n",
      "        OPTIONAL { <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/resource/Melisandre> <http://www.w3.org/2004/02/skos/core#prefLabel> ?name . FILTER(lang(?name)='en') . }       \n",
      "        OPTIONAL { <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/resource/Melisandre> <http://www.w3.org/2000/01/rdf-schema#label> ?name . FILTER(lang(?name)='en') . }        \n",
      "        OPTIONAL { <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/resource/Melisandre> <http://www.w3.org/2002/07/owl#sameAs> ?dbr . }\n",
      "    }\n",
      "    \n",
      "SELECT ?name ?dbr WHERE {        \n",
      "        # Get English label of URI\n",
      "        OPTIONAL { <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/resource/Ghost> <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/property/name> ?name . FILTER(lang(?name)='en') . }\n",
      "        OPTIONAL { <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/resource/Ghost> <http://www.w3.org/2004/02/skos/core#prefLabel> ?name . FILTER(lang(?name)='en') . }       \n",
      "        OPTIONAL { <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/resource/Ghost> <http://www.w3.org/2000/01/rdf-schema#label> ?name . FILTER(lang(?name)='en') . }        \n",
      "        OPTIONAL { <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/resource/Ghost> <http://www.w3.org/2002/07/owl#sameAs> ?dbr . }\n",
      "    }\n",
      "    \n",
      "SELECT ?name ?dbr WHERE {        \n",
      "        # Get English label of URI\n",
      "        OPTIONAL { <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/resource/Northmen> <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/property/name> ?name . FILTER(lang(?name)='en') . }\n",
      "        OPTIONAL { <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/resource/Northmen> <http://www.w3.org/2004/02/skos/core#prefLabel> ?name . FILTER(lang(?name)='en') . }       \n",
      "        OPTIONAL { <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/resource/Northmen> <http://www.w3.org/2000/01/rdf-schema#label> ?name . FILTER(lang(?name)='en') . }        \n",
      "        OPTIONAL { <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/resource/Northmen> <http://www.w3.org/2002/07/owl#sameAs> ?dbr . }\n",
      "    }\n",
      "    \n",
      "SELECT ?name ?dbr WHERE {        \n",
      "        # Get English label of URI\n",
      "        OPTIONAL { <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/resource/King_in_the_North> <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/property/name> ?name . FILTER(lang(?name)='en') . }\n",
      "        OPTIONAL { <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/resource/King_in_the_North> <http://www.w3.org/2004/02/skos/core#prefLabel> ?name . FILTER(lang(?name)='en') . }       \n",
      "        OPTIONAL { <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/resource/King_in_the_North> <http://www.w3.org/2000/01/rdf-schema#label> ?name . FILTER(lang(?name)='en') . }        \n",
      "        OPTIONAL { <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/resource/King_in_the_North> <http://www.w3.org/2002/07/owl#sameAs> ?dbr . }\n",
      "    }\n",
      "    \n",
      "SELECT ?name ?dbr WHERE {        \n",
      "        # Get English label of URI\n",
      "        OPTIONAL { <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/resource/Old_Gods_of_the_Forest> <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/property/name> ?name . FILTER(lang(?name)='en') . }\n",
      "        OPTIONAL { <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/resource/Old_Gods_of_the_Forest> <http://www.w3.org/2004/02/skos/core#prefLabel> ?name . FILTER(lang(?name)='en') . }       \n",
      "        OPTIONAL { <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/resource/Old_Gods_of_the_Forest> <http://www.w3.org/2000/01/rdf-schema#label> ?name . FILTER(lang(?name)='en') . }        \n",
      "        OPTIONAL { <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/resource/Old_Gods_of_the_Forest> <http://www.w3.org/2002/07/owl#sameAs> ?dbr . }\n",
      "    }\n",
      "    \n",
      "SELECT ?name ?dbr WHERE {        \n",
      "        # Get English label of URI\n",
      "        OPTIONAL { <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/resource/Kit_Harington> <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/property/name> ?name . FILTER(lang(?name)='en') . }\n",
      "        OPTIONAL { <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/resource/Kit_Harington> <http://www.w3.org/2004/02/skos/core#prefLabel> ?name . FILTER(lang(?name)='en') . }       \n",
      "        OPTIONAL { <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/resource/Kit_Harington> <http://www.w3.org/2000/01/rdf-schema#label> ?name . FILTER(lang(?name)='en') . }        \n",
      "        OPTIONAL { <http://dbkwik.webdatacommons.org/Game_of_Thrones_Wik/resource/Kit_Harington> <http://www.w3.org/2002/07/owl#sameAs> ?dbr . }\n",
      "    }\n",
      "    \n",
      "Jon Snow is a fictional character and a person. Its Allegiances are House Stark and The Night's Watch. Tormund's, Dim Dalba's and Melisandre's Allegiance is Jon Snow. Its Culture is Northmen. Its Titles are King in the North. Its Religion is Old Gods of the Forest. Its status are Alive. Its season is 1234567. Its Title is Jon Snow. Its Actor is Kit Harington. Its Places are Tower of Joy and Winterfell. Its Appearances are 49. \n"
     ]
    }
   ],
   "source": [
    "# Get predicate name from SPARQL\n",
    "for predicate in top_triples:\n",
    "    predicate_name = top_triples[predicate]['label'] # Check if this works properly\n",
    "    resources = []\n",
    "    r_resources = []\n",
    "    \n",
    "    for index in range(len(top_triples[predicate]['resources'])):\n",
    "        resource = top_triples[predicate]['resources'][index]                \n",
    "        resource_name = None\n",
    "        \n",
    "        if resource['resource'].startswith('http://'): # URI\n",
    "            resource_name = get_resource_name(resource['resource'])\n",
    "        else: # Literal\n",
    "            if resource['resource'][0] == '*': # Possibly bullet list which was not properly parsed by DBkwik\n",
    "                _resources = resource['resource'].split('*')\n",
    "                if len(_resources) > 1: # Then probably a bullet list\n",
    "                    _resources = _resources[1:]\n",
    "                    for index2 in range(len(_resources)):\n",
    "                        _resources[index2] = re.sub(r'[^a-zA-Z0-9 \\n\\.]', '', _resources[index2]).replace('{', '').replace('}', '').strip()\n",
    "                    if resource['reverse'] == 'true':\n",
    "                        r_resources += _resources\n",
    "                    else:\n",
    "                        resources += _resources\n",
    "            else:\n",
    "                resource_name = resource['resource'].replace('{', '').replace('}', '') # Handling parsing error where entity might have {}\n",
    "        \n",
    "        if resource_name == None: # Continue to next element if resource name was not properly set\n",
    "            continue\n",
    "            \n",
    "        if resource['reverse'] == 'true':\n",
    "            r_resources.append(resource_name)\n",
    "        else:\n",
    "            resources.append(resource_name)    \n",
    "    \n",
    "    if len(resources) > 3: # Restrict to 3 items\n",
    "        resources = resources[:3]\n",
    "        \n",
    "    if len(r_resources) > 3: # Restrict to 3 items\n",
    "        r_resources = r_resources[:3]\n",
    "            \n",
    "    if predicate_name == 'born':\n",
    "        # This part would be for verbs\n",
    "        summary += pronoun + ' was born in ' + combine_conjunctive_sentences(resources) + '. '\n",
    "    else:\n",
    "        if len(resources) == 1:\n",
    "            if p.singular_noun(predicate_name) == False or p.singular_noun(predicate_name) == predicate_name: # If singular predicate or plural and singular forms are the same (eg: species)\n",
    "                summary += possessive_pronoun + ' ' + predicate_name + ' is ' + resources[0] + '. '\n",
    "            else:\n",
    "                summary += possessive_pronoun + ' ' + predicate_name + ' are ' + resources[0] + '. '\n",
    "        elif len(resources) > 1:\n",
    "            if p.singular_noun(predicate_name) == False: # Convert to plural form\n",
    "                predicate_name = p.plural(predicate_name)\n",
    "            summary += possessive_pronoun + ' ' + predicate_name + ' are ' + combine_conjunctive_sentences(resources) + '. '\n",
    "\n",
    "        if len(r_resources) > 0:\n",
    "            r_resources = [get_possessive_form(resource) for resource in r_resources]\n",
    "            if p.singular_noun(predicate_name):\n",
    "                predicate_name = p.singular_noun(predicate_name)\n",
    "            summary += combine_conjunctive_sentences(r_resources) + ' ' + predicate_name + ' is ' + name + '. '\n",
    "            \n",
    "print(summary)    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "top_triples"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.4"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
